package interfaces;

import java.text.DateFormat;
import java.text.ParseException;
import java.text.SimpleDateFormat;
import java.util.*;

public class task6 {

    public static void main(String[] args) {
        String[] array1 = new String[]{
                "Нурматов Муратбек",
                "Мажитова Айчолпон",
                "Ниязахунова Сара",
                "Андашев Бексултан",
                "Байзакова Айсалкын",
                "Мамытова Жанылай",
                "Сейитова Нурайым",
                "Шин Екатерина",
                "Алсеитова Айтурган",
                "Нурадиль Жанадиль уулу",
                "Аманкулов Атай",
                "Капашев Амаль",
                "Камбаров Тенирберди",
                "Максутова Айбиике",
                "Султанова Чолпон",
                "Муратова Айдай",
                "Султанова Майрам",
                "Бейшенова Салтанат",
                "Тургунбаева Арууке",
                "Курстанбек уулу Нурмухамед",
                "Ирисов Темирлан",
                "Азаматов Элдар",
                "Султаналиева Райхан",
                "Исраилова Аяна",
                "Ким Андрей",
                "Ахметов Исмаил",
                "Керимов Адис",
                "Бакаев Дастан",
                "Курмангожоева Саадат",
                "Чаргинов Марсель",
                "Сайдахматов Эрланбек",
                "Нурланова Алсу",
                "Бакытбекова Аяна",
                "Турабаева Мадина",
                "Адилов Фархад",
                "Базарбаев Ислам",
                "Абдурасулов Адиль",
                "Мамажусупова Аймира",
                "Тулекеев Темирлан",
                "Сейтбек уулу Салават",
                "Арлен Азирет",
                "Эгенбаева Жамиля",
                "Эвелина Короткова",
                "Алишер уулу Актан",
                "Юсупова Камила",
                "Кадыркулов Санжар",
                "Орозбекова Кызжибек",
                "Джарашева Аян",
                "Сусликов Егор",
                "Кангельдиев Эльдар"
        };

        String[] array2 = new String[]{
                "Абдиев Алтай",
                "Абдрасулов Адиль",
                "Абдыкаримова Айдана",
                "Абдылдаев Элнур",
                "Адеми Ордобаева",
                "Адилов Фархад",
                "Азаматов Элдар",
                "Алексей Усманов",
                "Алишер уулу Актан",
                "Алсеитова Айтурган",
                "Аманкулов Атай",
                "Байзакова Айсалкын",
                "Бакиров Аман",
                "Бакытбекова Аяна",
                "Барпыбекова Милена",
                "Баянова Сурайё Бахтиер кизи",
                "Бейшенова Салтанат",
                "Бектемирова Уулкелсин",
                "Джапаралиева Алина",
                "Дуйшеналиев Адиль",
                "Жанышбеков Кылымбек ",
                "Ирисов Тамерлан ",
                "Ирисов Тамерлан ",
                "Камбаров Тенирберди ",
                "Кангелдиев Элдар ",
                "Капашев Амаль",
                "Карыпова Нуркан",
                "Керимов Адис",
                "Короткова Эвелина",
                "Курмангожоева Саадат",
                "Мажитова Айчолпон",
                "Максутова Айбике",
                "Мамажусупова Аймира",
                "Мамытова Жанылай",
                "Муратова Айдай",
                "Мырзабеков Эмир",
                "Нарматов Асылбек",
                "Ниязахунова Сара",
                "Нурбекова Алия",
                "Оморова Калиман",
                "Ордобаева Адеми",
                "Орозбекова Кызжибек",
                "Рустамов Артур",
                "Саламатов Кутман",
                "Сатыбалдиев Нурадил",
                "Сейитова Нурайым",
                "Султаналиева Райхан",
                "Султанова Майрам",
                "Султанова Хадижа",
                "Султанова Чолпон",
                "Сусликов Егор",
                "Токонова Аделина",
                "Тулекеев Темирлан",
                "Турабаева Мадина",
                "Туран Кутуев",
                "Тургунбаева Арууке",
                "Устемиров Марс",
                "Устмаров Алексей",
                "Чаргинов Марсель",
                "Шамурзаева Эльнура",
                "Шин Екатерина",
                "Эгенбаева Жамиля",
                "Юсупова Камила"

        };
        for(int i = 0; i < array1.length; ++i) {
            boolean found = false;
            for(int j = 0; j < array2.length; ++j) {
                if(array1[i] == array2[j]){
                found = true;
                break;
            }
        }
        if(!found)
        System.out.println(array1[i]);
    }

}

    }

